
/**
@file    Def_HW.h
@version OHT 7.0
@brief   HW에 공통으로 사용될 상수, 변수를 정의한 Header File
*/

#ifndef Def_HWH
#define Def_HWH

#include "Def_OHT.h"
#include "ErrorCode.h"


// -------------------------------------------
// IO 관련 구조체
// -------------------------------------------

/**
@brief   Input Bit Field 구조
         Input 0~63
@author  zzang9un
@date    2012.11.26
*/
typedef struct sINPUT_BITFIELD_
{
	UINT64 HAND_Inposition         : 1; // 0
    UINT64 HAND_Alarm              : 1; // 1
    UINT64 HAND_Right_Grip         : 1; // 2
    UINT64 HAND_Left_Grip          : 1; // 3
	UINT64 HAND_Close              : 1; // 4
    UINT64 HAND_Open               : 1; // 5
	UINT64 HAND_Push               : 1; // 6
	UINT64 HOIST_Home              : 1; // 7
    UINT64 HAND_PIO_Go             : 1; // 8
    UINT64 EQPIO_Load_REQ          : 1; // 9
    UINT64 EQPIO_Unload_REQ        : 1; // 10
    UINT64 EQPIO_Ready             : 1; // 11
    UINT64 EQPIO_HO_AVBL           : 1; // 12
    UINT64 EQPIO_ES                : 1; // 13
    UINT64 EQPIO_Left_Go           : 1; // 14
    UINT64 EQPIO_Right_Go          : 1; // 15
    UINT64 STEER_F_Left            : 1; // 16
	UINT64 STEER_R_Left            : 1; // 17
	UINT64 STEER_F_Right           : 1; // 18
    UINT64 STEER_R_Right           : 1; // 19
    UINT64 SHUTTER_F_Close         : 1; // 20
	UINT64 SHUTTER_R_Close         : 1; // 21
    UINT64 SHUTTER_F_Open          : 1; // 22
    UINT64 SHUTTER_R_Open          : 1; // 23
    UINT64 SHUTTER_F_Alarm         : 1; // 24
    UINT64 SHUTTER_R_Alarm         : 1; // 25
    UINT64 SHUTTER_F_Inposition    : 1; // 26
    UINT64 SHUTTER_R_Inposition    : 1; // 27
    UINT64 OBSTACLE_Long           : 1; // 28
    UINT64 OBSTACLE_Middle         : 1; // 29
    UINT64 OBSTACLE_Short          : 1; // 30
    UINT64 OBSTACLE_Fail           : 1; // 31
    UINT64 OHTDETECT_Long          : 1; // 32
    UINT64 OHTDETECT_Middle        : 1; // 33
    UINT64 OHTDETECT_Short         : 1; // 34
    UINT64 OHTDETECT_Fail          : 1; // 35
    UINT64 LOOKDOWN_Detect         : 1; // 36
    UINT64 LOOKDOWN_Error          : 1; // 37
    UINT64 SHIFT_Home              : 1; // 38
    UINT64 STB_Detect_Left         : 1; // 39
    UINT64 STB_Detect_Right        : 1; // 40
    UINT64 UTB_Detect              : 1; // 41
	UINT64 FOUP_Detect             : 1; // 42
	UINT64 OSCILLATION             : 1; // 43
	UINT64 EMO_Press               : 1; // 44
    UINT64 BUMPER_Press            : 1; // 45
    UINT64 FAN_Fail                : 1; // 46
    UINT64 STB_OHT_Detect_Left     : 1; // 47
    UINT64 STB_OHT_Detect_Right    : 1; // 48
	UINT64 HANDTP_Connect          : 1; // 49
    UINT64 STOP_Driving_PreCheck   : 1; // 50
    UINT64 MC_Status               : 1; // 51
    UINT64 STOP_Driving_Front      : 1; // 52
    UINT64 STOP_Trans_Front        : 1; // 53
    UINT64 STOP_Trans_Rear         : 1; // 54
    UINT64 BCR_Driving_OK          : 1; // 55
    UINT64 BCR_Driving_NG          : 1; // 56
    UINT64 BCR_Trans_OK            : 1; // 57
    UINT64 BCR_Trans_NG            : 1; // 58
    UINT64 OHT_COMM_CD             : 1; // 59
    UINT64 RailSupport_Home      : 1; // 60
	UINT64 Railsupport_Work      : 1; // 61
    UINT64 MAC_Detect      : 1; // 62
    UINT64 SMPS_Short      : 1; // 63
} sINPUT_BITFIELD;

/**
@brief   Input(0~63) Bit Field 사용을 위한 Union 구조체
@author  zzang9un
@date    2012.11.26
*/
typedef union uINPUT_BITFIELD_
{
	sINPUT_BITFIELD Info;
    UINT64 Data;
} uINPUT_BITFIELD;



/**
@brief   HWCommon에서 사용하는 Input 64개
@author  zzang9un
@date    2012.10.15
@note    Bit Filed에서 unsigned char로 변경
*/
#if (OHT_NAME == OHT_NAME_STD_V80)
typedef struct sINPUTR01_
{
	BYTE HAND_Inposition;
	BYTE HAND_Alarm;
	BYTE HAND_Right_Grip;
	BYTE HAND_Left_Grip;
	BYTE HAND_Close;
	BYTE HAND_Open;
	BYTE HAND_Push;
	BYTE HOIST_Home;
	BYTE HAND_PIO_Go;
	BYTE EQPIO_Load_REQ;
	BYTE EQPIO_Unload_REQ;
	BYTE EQPIO_Ready;
	BYTE EQPIO_HO_AVBL;
	BYTE EQPIO_ES;
	BYTE EQPIO_Right_Go;
	BYTE EQPIO_Left_Go;
	BYTE STEER_F_Left;
	BYTE STEER_R_Left;
	BYTE STEER_F_Right;
	BYTE STEER_R_Right;
	BYTE SHUTTER_F_Close;
	BYTE SHUTTER_R_Close;
	BYTE SHUTTER_F_Open;
	BYTE SHUTTER_R_Open;
	BYTE SHUTTER_F_Alarm;
	BYTE SHUTTER_R_Alarm;
	BYTE SHUTTER_F_Inposition;
